src/Documents/КАЗ_ПланОплат/КАЗ_ПланОплат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КАЗ_ПланОплат</name>
  <attributes>
    <name>ПериодПлана</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Платежи</name>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.КАЗ_ЗаявкаНаОплату</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОплаты</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОчередьОплаты</name>
      <type>
        <types>CatalogRef.КАЗ_ОчередиПлатежей</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/КАЗ_ПланОплат/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если Платежи.Количество() = 0 Тогда
		Сообщить("Не заполнена табличная часть платежей.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Для Каждого СтрокаПлатежа Из Платежи Цикл

		Если Не ЗначениеЗаполнено(СтрокаПлатежа.Заявка) Тогда
			Сообщить("В строке плана не выбрана заявка.");
			Отказ = Истина;
			Возврат;
		КонецЕсли;

		Если СтрокаПлатежа.Сумма <= 0 Тогда
			Сообщить("Сумма платежа в плане должна быть больше нуля.");
			Отказ = Истина;
			Возврат;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры
